package algorithms.string_primitive_integer.next_permutation;
/*
 1 5 4 3 2. Мы  с конца ищем уменьшающуюся последовательность.
            затем берем элемент сразу перед началом уменьшаующейся подпоследовательности
            и меняем его на элемент который следующий .
            в этом случае уменьшающийся отрезок это 5 4 3 2.
            перед ним 1 и меняем его на 2. получаем 2 5 4 3 1. теперь надо перевернуть что у нас было после 2.
             2 1 3 4 5.
 */
public class Solution {
    //31 leetcode
}
